pitzDaily_bAB/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is a Copy of $FOAM_TUTORIALS/resources/blockMesh/pitzDaily

convertToMeters 0.001;

vertices
(
    (-30 -4 -0.5)  // 0
    (0 -4 -0.5)    // 1
    (0.5 -4 -0.5)  // 2
    (190 -4 -0.5)  // 3
    (190 0 -0.5)   // 4
    (190 7 -0.5)   // 5
    (1.5 7 -0.5)   // 6
    (0.5 0 -0.5)   // 7
    (0 0 -0.5)     // 8
    (0 7 -0.5)     // 9
    (-30 7 -0.5)   //10
    (-30 0 -0.5)   //11

    (-30 -4 0.5)   //12
    (0 -4 0.5)     //13
    (0.5 -4 0.5)   //14
    (190 -4 0.5)   //15
    (190 0 0.5)    //16
    (190 7 0.5)    //17
    (1.5 7 0.5)    //18
    (0.5 0 0.5)    //19
    (0 0 0.5)      //20
    (0 7 0.5)      //21
    (-30 7 0.5)    //22
    (-30 0 0.5)    //23
    
	(-220	-4	-0.5)	//	24
	(-219.5	-4	-0.5)	//	25
	(-30	-4	-0.5)	//	26
	(-30	0	-0.5)	//	27
	(-30	7	-0.5)	//	28
	(-218.5	7	-0.5)	//	29
	(-219.5	0	-0.5)	//	30
	(-220	0	-0.5)	//	31
	(-220	7	-0.5)	//	32
					
					
					
	(-220	-4	0.5)	//	33
	(-219.5	-4	0.5)	//	34
	(-30	-4	0.5)	//	35
	(-30	0	0.5)	//	36
	(-30	7	0.5)	//	37
	(-218.5	7	0.5)	//	38
	(-219.5	0	0.5)	//	39
	(-220	0	0.5)	//	40
	(-220	7	0.5)	//	41
					
					
	(200	-4	-0.5)	//	42
	(200	0	-0.5)	//	43
	(200	7	-0.5)	//	44
	(200	-4	0.5)	//	45
	(200	0	0.5)	//	46
	(200	7	0.5)	//	47


);

negY
(
    (2 4 1)
    (1 3 0.3)
);

posY
(
    (1 4 2)
    (2 3 4)
    (2 4 0.25)
);

posYR
(
    (2 1 1)
    (1 1 0.25)
);


blocks
(
    hex (11 8 9 10 23 20 21 22)   //block 0
    (34 33 1)
    simpleGrading (0.054 1 1)

    hex (0 1 8 11 12 13 20 23)    //block 1
    (34 17 1)
    simpleGrading (0.054 1 1)

    hex (1 2 7 8 13 14 19 20)     //block 2
    (5 17 1)
    simpleGrading (1 1 1)

    hex (7 4 5 6 19 16 17 18)     //block 3
    (95 33 1)
    simpleGrading (47 1 1)

    hex (2 3 4 7 14 15 16 19)     //block 4
    (95 17 1)
    simpleGrading (47 1 1)

    hex (32 29 30 31 41 38 39 40)	//block	5　
    (34 33 1)
    simpleGrading (0.054 1 1)

    hex	(24 25 29 32 33 34 38 41)	//block	6　
    (34 17 1)
    simpleGrading (0.054 1 1)
 
    hex	(25 26 28 29 34 35 36 38)	//block	7　
    (5 17 1)
    simpleGrading (1 1 1)

    hex	(28 11 10 27 36 23 22 37)	//block	8　
    (95 33 1)
    simpleGrading (47 1 1)

    hex	(26 0 11 28 35 12 23 36)	//block	9
    (95 17 1)
    simpleGrading (47 1 1)
    
    hex (4 43 44 5 16 46 47 17)    //block 10
    (1 33 1)
    simpleGrading (1 1 1)

    hex (3 42 43 4 15 45 46 16)    //block 11
    (1 17 1)
    simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    plasmaInlet
    {
        type patch;
//	neighbourPatch outlet;
        faces
        (
            (0 12 23 11)
	    (11 23 22 10)
        );
    }
    plasmaOutlet
    {
        type patch;
//	neighbourPatch inlet;
        faces
        (
            (3 15 16 4)
            (4 16 17 5)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (10 9 21 22)
            (8 20 21 9)
            (8 7 19 20)
            (7 19 18 6)
	    (6 5 17 18)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
            (2 3 15 14)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (11 8 9 10)
            (0 1 8 11)
            (1 2 7 8)
            (7 4 5 6)
            (2 3 4 7)
            (23 20 21 22)
            (12 13 20 23)
            (13 14 19 20)
            (19 16 17 18)
            (14 15 16 19)
        );
    }

    inlet
    {
        type patch;
//	neighbourPatch outlet;
        faces
        (
            (32 41 40 31)
	    (24 33 41 32)
        );
    }

//    Outlet

    upperWall_upstream
    {
        type wall;
        faces
        (
            (31 30 39 40)
            (29 38 39 30)
            (29 38 36 28)
            (28 36 37 27)
	    (27 37 22 10)
        );
    }
    lowerWall_upstream
    {
        type wall;
        faces
        (
            (24 33 34 25)
            (25 34 35 26)
            (26 35 12 0)
        );
    }
    frontAndBack_upstream
    {
        type empty;
        faces
        (
            (31 32 29 30)
            (24 25 29 32)
            (25 26 28 29)
            (28 11 10 27)
            (26 0 11 28)
            (41 38 39 40)
            (33 34 38 41)
            (34 35 36 38)
            (36 23 22 37)
            (35 12 23 36)
        );
    }

    upperWall_downstream
    {
	type wall;
	faces
	(
	    (5 44 47 17)
	);
    }
    lowerWall_downstream
    {
	type wall;
	faces
	(
	    (3 42 45 15)
	);
    }
    frontAndBack_downstream
    {
	type empty;
	faces
	(
	    (4 43 44 5)
	    (3 42 43 4)
	    (16 46 47 17)
	    (15 45 46 16)
	);
    }

    outlet
    {
        type patch;
        faces
        (
            (43 46 47 44)
	    (42 45 46 43)
        );
);

// ************************************************************************* //
